Learning groupby with python

In [2]:
import numpy as np 
import pandas as pd

In [3]:
data = {'company':['goog','goog','msft','msft','fb','fb'],
       'person':['modi','godi','ram','kirti','golu','shyam'],
       'salse':[100,200,300,400,340,300]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  company person  salse
0    goog   modi    100
1    goog   godi    200
2    msft    ram    300
3    msft  kirti    400
4      fb   golu    340
5      fb  shyam    300

In [6]:
df.groupby('company')

In [7]:
bycomp = df.groupby('company')

In [8]:
bycomp

In [10]:
bycomp.mean()

         salse
company
fb       320.0
goog     150.0
msft     350.0

In [11]:
bycomp.sum()

         salse
company
fb         640
goog       300
msft       700

In [12]:
bycomp.std()

             salse
company
fb       28.284271
goog     70.710678
msft     70.710678

In [13]:
bycomp.sum().loc['fb']

salse    640
Name: fb, dtype: int64

In [14]:
df.groupby('company').count()

         person  salse
company
fb            2      2
goog          2      2
msft          2      2

In [16]:
df.groupby('company').min()

        person  salse
company
fb        golu    300
goog      godi    100
msft     kirti    300

In [19]:
df.groupby('company').describe().transpose()['fb']

salse  count      2.000000
       mean     320.000000
       std       28.284271
       min      300.000000
       25%      310.000000
       50%      320.000000
       75%      330.000000
       max      340.000000
Name: fb, dtype: float64

In [20]:
df.groupby('company').describe()

        salse
        count   mean        std    min    25%    50%    75%    max
company
fb        2.0  320.0  28.284271  300.0  310.0  320.0  330.0  340.0
goog      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
msft      2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0

In [22]:
df.groupby('company').describe().transpose()

company              fb        goog        msft
salse count    2.000000    2.000000    2.000000
      mean   320.000000  150.000000  350.000000
      std     28.284271   70.710678   70.710678
      min    300.000000  100.000000  300.000000
      25%    310.000000  125.000000  325.000000
      50%    320.000000  150.000000  350.000000
      75%    330.000000  175.000000  375.000000
      max    340.000000  200.000000  400.000000